Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N06.tmx
Source language: en_us
Languages: zh_cn

source: A wizened, elflike man at Verna's lunchtime table grumbles that he hopes they'll be seeing something more exciting than rocks.
zh_cn: 午餐时弗娜桌上有个干瘪的小老头嘟囔说他希望他们能看到些精彩的东西，而不是石头。

source: He's one of the other Bobs: Verna's been taking an inventory. An extra Bob may come in handy.
zh_cn: 他是另一个鲍勃，弗娜一直在囤货，多一个鲍勃也许会很方便。

source: "I'm looking forward to them," she says. "The stone mattresses." She gives the word "mattress" the tiniest hint of suggestiveness, and gets an approving twinkle out of Bob the Second.
zh_cn: “我很期待呢，”她说，“石床。”她给“床”这个字加了点若有若无的微妙暗示，于是从鲍勃二号那儿得了个鼓励的眼神。

source: Really, they're never too old to flirt.
zh_cn: 真的，这些人永远不会老得调不动情。

source: Out on deck after coffee, she surveys the approaching land through her binoculars.
zh_cn: 喝完咖啡走到甲板上，她从望远镜里观察着愈来愈近的那片陆地。

source: It's autumn here: the leaves on the miniature trees that snake along the ground like vines are red and orange and yellow and purple, with rock surging out of them in waves and folds.
zh_cn: 这里是秋天：微型树在地面上蜿蜒如藤蔓，树叶是红的、桔红的、黄的，和紫的，石块在它们的摇曳和叠嶂间或隐或现。

source: There's a ridge, a higher ridge, then a higher one.
zh_cn: 有一道山脊，还有一道更高的，接着更有高的。

source: It's on the second ridge that the best stromatolites are to be found, the geologist has told them.
zh_cn: 最好的石床是要在第二道山脊上看的，那个地质学家告诉过他们。

source: Will someone who has slipped behind the third ridge be visible from the second one?
zh_cn: 如果有人从第二座山脊闪到第三座后面的话，会被人看到吗？

source: Verna doesn't think so.
zh_cn: 弗娜觉得不会。

source: Now they're all stuffed into their waterproof pants and their rubber boots; now they're being zipped and buckled into their life jackets like outsized kindergarten kids; now they're turning their tags from green to red; now they're edging down the gangway and being whisked into the black inflatable Zodiacs.
zh_cn: 现在他们全都塞进了自己的防水裤和橡胶鞋里；他们也像超大的幼儿园孩子般被扣上了救生衣，拉上了拉链；他们也把自己的姓名标签从绿色翻成红色；舷梯缓缓放下，他们快步走进了那些黑色的充气艇里。

source: Bob has made it into Verna's Zodiac.
zh_cn: 鲍勃设法上了弗娜的那只。

source: He lifts his camera, snaps her picture.
zh_cn: 他举起照相机，咔嚓给她拍了一张。

source: Verna's heart is beating more rapidly.
zh_cn: 弗娜的心脏跳动得更快了。

source: If he recognizes me spontaneously, I won't kill him, she thinks.
zh_cn: 如果他自然而然认出了我，我就不杀他了，她想。

source: If I tell him who I am and he recognizes me and then apologizes, I still won't kill him.
zh_cn: 如果我告诉他自己是谁，然后他才认出了我，但是向我道歉了，我也不杀他。

source: That's two more escape chances than he gave her.
zh_cn: 比起当初他对她，这要多了两次逃跑的机会。

source: It will mean forgoing the advantage of surprise, a move that could be hazardous- Bob is much bigger than she is- but she wishes to be more than fair.
zh_cn: 这意味着放弃突袭的优势，是个充满了危险的举动——鲍勃比她可强壮多了——但是她希望能够做到十二万分的公平。

source: They've landed and have shed their life jackets and rubber footwear and are lacing up their hiking boots.
zh_cn: 他们上岸了，脱下救生衣和橡胶鞋，系紧徒步靴的鞋带。

source: Verna strolls closer to Bob, notes that he hasn't bothered with the rubber boots.
zh_cn: 弗娜溜达着向鲍勃靠近，注意到他没理会橡胶鞋的事。

source: He's wearing a red baseball cap; as she watches, he turns it backward.
zh_cn: 他戴着一顶红色的棒球帽，她瞧着他把帽檐拉到了后面。

source: Now they're all scattering.
zh_cn: 现在他们全都分散开来。

source: Some stay by the shore; some move up to the first ridge.
zh_cn: 有些人留在岸边，有些人去爬第一道山脊。

source: The geologist is standing there with his hammer, a twittering cluster already gathered around him.
zh_cn: 地质学家拿着铁锤站在那儿，一群叽叽喳喳的人已经围着他了。

source: He's in full lecture mode: they will please not take any of the stromatolites, but the ship has a sampling permit, so if anyone finds a particularly choice fragment, especially a cross section, check with him first and they can put it on the rock table he'll set up on board, where everyone can see it.
zh_cn: 他沉浸在讲课的状态中：请他们一点点叠层石都别拿，不过游轮允许有一个样本，所以如果有人看到特别的一块，尤其是带横切面的，就跟他先核对一下，他在船上设了一个可以放置石头的桌子，他们可以把它放那儿，这样每个人都能看一看了。

source: Here are some examples, for those who may not want to tackle the second ridge. . . .
zh_cn: 对那些也许不想对付第二座山脊的人来说，这里有一些样本......

source: Heads go down; cameras come out.
zh_cn: 脑袋都低了下去，照相机都拿了出来。

source: Perfect, Verna thinks.
zh_cn: 太完美了，弗娜想。

source: The more distraction the better.
zh_cn: 干扰越多越好。

source: She feels without looking that Bob is close by.
zh_cn: 她不用看就感觉到鲍勃在附近。

source: Now they're at the second ridge, which some are climbing more easily than others.
zh_cn: 现在他们在第二座山脊，某些人比其他人爬得轻松些。

source: Here are the best stromatolites, a whole field of them.
zh_cn: 这里有最好的叠层石，一整片都是。

source: There are unbroken ones, like bubbles or boils, small ones, ones as big as half a soccer ball.
zh_cn: 有些是完整的块状，像一个个气泡或者疖子，都是小块，半个足球那样大小。

source: Some have lost their tops, like eggs in the process of hatching.
zh_cn: 有些顶部没了，像正在孵化的蛋。

source: Still others have been ground down, so that all that's left of them is a series of raised concentric oblongs, like a cinnamon bun or the growth rings on a tree.
zh_cn: 其他的仍然是被破坏了的，因此所剩下的不过是一系列突起的同心椭圆状，像一只肉桂面包卷或者一棵树的年轮。

source: And here's one shattered into four, like a Dutch cheese sliced into wedges.
zh_cn: 有一个碎成了四块，像被切成了四片的荷兰乳酪。

source: Verna picks up one of the quarters, examines the layers, each year black, gray, black, gray, black, and at the bottom the featureless core.
zh_cn: 弗娜捡起四分之一块，查看它的纹理，一年黑，一年灰，一年黑，一年灰，一年黑，而底部是毫无特色的石核。

source: The piece is heavy, and sharp at the edges.
zh_cn: 这块石头很重，边缘锐利。

source: Verna lifts it into her backpack.
zh_cn: 弗娜把它举起来放进了背包。

source: Here comes Bob as if on cue, lumbering slowly as a zombie up the hill toward her.
zh_cn: 正在此时鲍勃过来了，他行动迟缓，像个僵尸般上山向她走来。

source: He's taken off his outer jacket, tucked it under his backpack straps.
zh_cn: 他脱了外套，把它塞在背包带里。

source: He's out of breath.
zh_cn: 他气都喘不上来了。

source: She has a moment of compunction: he's over the hill; frailty is gaining on him.
zh_cn: 她一瞬间有些内疚：他爬上了山，虚弱正在压垮他。

source: Shouldn't she let bygones be bygones?
zh_cn: 难道她不该让过去的事就过去吗？

source: Boys will be boys.
zh_cn: 男孩子总是男孩子。

source: Aren't they all just hormone puppets at that age?
zh_cn: 那个年龄的他们不都是些荷尔蒙的傀儡么？

source: Why should any human being be judged by something that was done in another time, so long ago it might be centuries?
zh_cn: 人凭什么应该被以前的事审判呢，都过去那么久也许都好几个世纪了？

source: A raven flies overhead, circles around.
zh_cn: 一只乌鸦在头顶上飞，盘旋着。

source: Can it tell?
zh_cn: 它知道吗？

source: Is it waiting?
zh_cn: 它是在等待吗？

source: She looks down through its eyes, sees an old woman- because, face it, she is an old woman now- on the verge of murdering an even older man because of an anger already fading into the distance of used-up time.
zh_cn: 她通过它的眼睛往下看，看见了一个老女人——因为，面对现实吧，她现在是个老女人了——正处在谋杀的边缘，要杀掉一个甚至比她更老些的男人，原因是那已经随着过去的时间逐渐淡化了的愤怒。

source: It's paltry.
zh_cn: 这是可鄙的。

source: It's vicious.
zh_cn: 这是罪恶的。

source: It's normal.
zh_cn: 这是常见的。

source: It's what happens in life.
zh_cn: 这就是生活。

source: "Great day," Bob says.
zh_cn: “天气真棒，”鲍勃说。

source: "It's good to have a chance to stretch your legs."
zh_cn: “有个机会伸伸腿还是挺不错的。”

source: "Isn't it?" Verna says.
zh_cn: “可不是吗？”弗娜说。

source: She moves toward the far side of the second ridge.
zh_cn: 她转向第二座山脊的远侧。

source: "Maybe there's something better over there.
zh_cn: “也许那儿有更好的东西。

source: But weren't we told not to go that far?
zh_cn: 不过是不是告诉我们不要走太远？

source: Out of sight?"
zh_cn: 别离开视线？”

source: Bob gives a rules-are-for-peasants laugh. "We're paying for this," he says.
zh_cn: 鲍勃发出一声“老土才在乎规则”的大笑，“咱们为这可是付了钱的，”他说。

source: He actually takes the lead, not up the third ridge but around behind it.
zh_cn: 事实上他领头先走了，没去爬第三座山脊，而是绕道后面。

source: Out of sight is where he wants to be.
zh_cn: 他想去避开视线的地方。

source: The gun bearer on the second ridge is yelling at some people straying off to the left.
zh_cn: 第二座山脊上带枪的人正冲某些向左边游逛的人嚷嚷。

source: He has his back turned.
zh_cn: 他背对着他们。

source: A few more steps and Verna glances over her shoulder: she can't see anyone, which means that no one can see her.
zh_cn: 还有几步了，弗娜从肩膀上瞥了一眼，她看不见任何人，这意味着也没人能看见她。

source: They squelch over a patch of boggy ground.
zh_cn: 他们咯咯吱吱地走过一片泥沼地。

source: She takes her thin gloves out of her pocket, slips them on.
zh_cn: 她从口袋里掏出薄手套，戴上。

source: Now they're at the far side of the third ridge, at the sloping base.
zh_cn: 现在他们在第三座山脊的背面，在斜坡脚下。

source: "Come over here," Bob says, patting the rock.
zh_cn: “到这儿来，”鲍勃拍拍石头说到。

source: His backpack is beside him.
zh_cn: 他的背包放在身边。

source: "I brought us a few drinks."
zh_cn: “我给咱们带了些饮料。”

source: All around him is a tattered gauze of black lichen.
zh_cn: 他周围是一片斑驳稀薄的黑色苔藓。

source: "Terrific," Verna says.
zh_cn: “太棒了，”弗娜说。

source: She sits down, unzips her backpack.
zh_cn: 她坐了下来，拉开背包拉链。

source: "Look," she says.
zh_cn: “瞧，”她说。

source: "I found a perfect specimen."
zh_cn: “我找到一块完美的样本。”

source: She turns, positioning the stromatolite between them, supporting it with both hands.
zh_cn: 她转过身，把那块叠层石放在他们之间，用两手稳住。

source: She takes a breath.
zh_cn: 她吸了口气。

source: "I think we've known each other before," she says.
zh_cn: “我想咱们以前认识，”她说。

source: "I'm Verna Pritchard.
zh_cn: “我是弗娜·普里查德。

source: From high school."
zh_cn: 高中同学。”

source: Bob doesn't miss a beat.
zh_cn: 鲍勃面不改色心不跳。

source: "I thought there was something familiar about you," he says.
zh_cn: “我就觉得你身上有些挺熟悉的东西，”他说。

source: He's actually smirking.
zh_cn: 他居然在傻笑。

source: She remembers that smirk.
zh_cn: 她记得这个笑。

source: She has a vivid picture of Bob capering triumphantly in the snow, sniggering like a ten-year-old.
zh_cn: 她脑海里有一幅栩栩如生的画面：鲍勃在雪地上胜利地欢蹦乱跳，像个十岁小孩般窃笑不已。

source: Herself wrecked and crumpled.
zh_cn: 她本人被摧毁崩溃了。

source: She knows better than to swing widely.
zh_cn: 她没笨到去大幅甩动。

source: She brings the stromatolite up hard, a short sharp jab right underneath Bob's lower jaw.
zh_cn: 她把叠层石用力举起，一个短促尖锐的重击，正中鲍勃的下颚下方。

source: There's a crunch, the only sound.
zh_cn: 有声碎裂，那是唯一的响声。

source: His head snaps back.
zh_cn: 他的头啪嗒倒了回来。

source: Now he's sprawled on the rock.
zh_cn: 现在他摊在石头上了。

source: She holds the stromatolite over his forehead, lets it drop.
zh_cn: 她把叠层石举到他的额头上，让它落下。

source: Again.
zh_cn: 又一次。

source: Once again.
zh_cn: 再来一次。

source: There.
zh_cn: 好了。

source: That seems to have done it.
zh_cn: 现在似乎可以了。

source: Bob looks ridiculous, with his eyes open and fixed and his forehead mashed in and blood running down both sides of his face.
zh_cn: 鲍勃看上去很荒唐，眼睛睁着，凝滞不动，前额碎成了糊状，和着血流下脸的两颊。

source: "You're a mess," she says.
zh_cn: “你真是一团糟，”她说。

source: He looks laughable, so she laughs.
zh_cn: 他看上去很可笑，于是她笑了。

source: As she suspected, the front teeth are implants.
zh_cn: 正如她怀疑的，门牙是假的。

source: She takes a moment to steady her breathing.
zh_cn: 她花了一刻稳住呼吸。

source: Then she retrieves the stromatolite, being careful not to let any of the blood touch her or even her gloves, and slides it into a pool of bog water.
zh_cn: 然后，她拿回那块叠层石，注意不要沾上丝毫血迹，甚至手套也不行，把它滑入泥塘的一汪水中。

source: Bob's baseball cap has fallen off; she stuffs it into her pack, along with his jacket.
zh_cn: 鲍勃的棒球帽掉了下来，她把它和他的外套一起塞进自己的背包。

source: She empties out his backpack: nothing in there but the camera, a pair of woollen mitts, a scarf, and six miniature bottles of Scotch- how pathetically hopeful of him.
zh_cn: 她清空了他的包：没什么东西，就照相机、一双羊毛手套、一条围巾，还有六小瓶苏格兰威士忌——可怜的他真是充满了希望啊。

source: She rolls the pack up, stuffs it inside her own, adds the camera, which she'll toss into the sea later.
zh_cn: 她把包卷起来，塞进自己的背包，又放进照相机，这些她以后会扔进海里。

source: Then she dries the stromatolite off on the scarf, checking to make sure there's no visible blood, and stows it in her pack.
zh_cn: 接着她用围巾把叠层石擦干，查看了一番，确定看不见血迹了，就装进了背包。

source: She leaves Bob to the ravens and the lemmings and the rest of the food chain.
zh_cn: 她把鲍勃留给了乌鸦，旅鼠和其他食物链上的动物。

source: Then she hikes back around the base of the third ridge, adjusting her jacket.
zh_cn: 然后，她绕着第三座山脊的山脚走了回去，整理着外套。

source: Anyone looking will assume she's just been having a pee.
zh_cn: 任何看到的人都会以为她刚刚去小便了。

source: People do sneak off like that, on shore visits.
zh_cn: 上岸观光时，人们常溜去这么干。

source: But no one is looking.
zh_cn: 不过没人看她。

source: She finds the young geologist- he's still on the second ridge, along with his coterie of admirers- and produces the stromatolite.
zh_cn: 她找到那个年轻的地质学家——他还在第二座山脊上，与那一小圈崇拜者在一起——拿出那块叠层石。

source: "May I take it back to the ship?" she asks sweetly.
zh_cn: “能让我把它带回船上吗？”她甜甜地问着。

source: "For the rock table?"
zh_cn: “放在那张展览桌上？”

source: "Fantastic sample!" he says.
zh_cn: “这块样本妙极了！”他说。

source: Travellers are making their way shoreward, back to the Zodiacs.
zh_cn: 旅行者们向岸边走去，返回充气艇。

source: When she reaches the bags with the life jackets, Verna fumbles with her shoelaces until all eyes are elsewhere and she can cram an extra life jacket into her backpack.
zh_cn: 走到装着救生衣的袋子前时，弗娜磨磨蹭蹭地系着鞋带，趁无人看见，多塞了一件到自己的背包里。

source: The pack is a lot bulkier than it was when she left the ship, but it would be odd if anyone noticed that.
zh_cn: 这背包比她离开游轮时鼓出了许多，不过有人注意这个才怪呢。

source: Once up the gangway, she diddles around with her pack until everyone else has moved past the tag board, then flips Bob's tag from red to green.
zh_cn: 等上了舷梯，她摆弄起背包来，直到其他人都从那块标签板前走过去，然后把鲍勃的牌子从红色翻成绿色。

source: And her own tag, too, of course.
zh_cn: 当然还有她自己的。

source: On the way to her cabin she waits till the corridor is clear, then slips through Bob's unlocked door.
zh_cn: 在回舱室的路上，她等过道里没人就溜进鲍勃开着的门里。

source: The room key is on the dresser; she leaves it there.
zh_cn: 房间钥匙在柜子上，她没动。

source: She hangs up the life jacket and Bob's waterproof and baseball cap, runs some water in the sink, messes up a towel.
zh_cn: 她把救生衣、鲍勃的防水设备和棒球帽都挂好，把水池的龙头打开了一会儿，弄乱了一条毛巾。

source: Then she goes to her own cabin along the still-empty corridor, takes off her gloves, washes them, and hangs them up to dry.
zh_cn: 然后，她沿着仍然空无一人的过道走回自己的舱室，脱掉手套，洗干净，挂起来晾干。

source: She's broken a nail, worse luck, but she can repair that.
zh_cn: 裂了一个指甲，太不幸了，不过能修复。

source: She checks her face: a touch of sunburn, but nothing serious.
zh_cn: 她审视了下自己的脸：只有一点儿晒伤，无甚大碍。

source: For dinner, she dresses in pink and makes an effort to flirt with Bob the Second, who gamely returns her serves but is surely too decrepit to be a serious prospect.
zh_cn: 晚餐时，她穿了件粉色礼服，努力和鲍勃二号调情，他勇敢地接着她发过来的球，不过显然过于老朽，不适合作为一种可能性去认真对待了。

source: Just as well- her adrenaline level is plummeting.
zh_cn: 倒也无妨——她的肾上腺素也正急速下降呢。

source: If there are northern lights, they've been told, there will be an announcement, but Verna doesn't intend to get up for them.
zh_cn: 他们接到通知，说如果出现了北极光，会有人来叫他们，但弗娜不打算起身去看了。

source: So far she's in the clear.
zh_cn: 目前为止她清清白白。

source: All she has to do now is maintain the mirage of Bob, faithfully turning his tag from green to red, from red to green.
zh_cn: 她现在所需做的就是保持住鲍勃的幻象，忠实地把他的名卡从绿色翻成红色，从红色翻成绿色。

source: He'll move objects around in his cabin, wear different items from his beige-and-plaid wardrobe, sleep in his bed, take showers, leaving the towels on the floor.
zh_cn: 他的舱室里的东西要不时挪动一下，要从他那米色和格子的行头中拿出不同的衣服来，他的床上要睡觉，还有洗澡，把毛巾留在地板上。

source: He will receive a first-name-only invitation to have dinner at a staff table, which will then quietly appear under the door of one of the other Bobs, and no one will spot the substitution.
zh_cn: 他会收到一封请他在工作人员餐桌用餐的不带姓氏只有名字的邀请函，这封邀请函会悄悄出现在其他一个鲍勃的门缝里，没人会认出替不替身的。

source: He will brush his teeth.
zh_cn: 他要刷牙。

source: He will adjust his alarm clock.
zh_cn: 他要调整闹钟。

source: He will send in laundry, without, however, filling out the slip: that would be too risky.
zh_cn: 他会送洗衣服然而并没有填洗衣单：那样太危险。

source: The cleaning staff won't care- a lot of older people forget to fill out their laundry slips.
zh_cn: 清洗工不会在意的——很多老人都忘记填他们的洗衣单。

source: Meanwhile, the stromatolite will sit on the geological samples table and will be picked up and examined and discussed, acquiring many fingerprints.
zh_cn: 与此同时，那块叠层石会留在那张地质陈列桌上，会被人拿起来查看和讨论，留下许多指纹。

source: At the end of the trip it will be jettisoned.
zh_cn: 旅途终了时它会被丢掉。

source: The Resolute II will travel for fourteen days; it will stop for shore visits eighteen times.
zh_cn: “果敢二号”要旅行十四天，它要停下十八次上岸游览。

source: It will sail past ice caps and sheer cliffs, and mountains of gold and copper and ebony black and silver gray; it will glide through pack ice; it will anchor off long, implacable beaches and explore fjords gouged by glaciers over millions of years.
zh_cn: 它要驶过冰原和陡峭的悬崖，还有五彩斑斓的高山；它要从浮冰中滑过；它要停泊在难以平静的长长的海滩上，要探究冰川历时百万年雕凿出的海峡。

source: In the midst of such rigorous and demanding splendor, who will remember Bob?
zh_cn: 如此耗时费力严酷的壮丽景象，其间哪儿有人会想起鲍勃？

source: There will be a moment of truth at the end of the voyage, when Bob will not appear to pay his bill and pick up his passport; nor will he pack his bags.
zh_cn: 在航行收尾时会有一刻真相浮现，那时鲍勃不会现身去支付帐单，取走护照，也不会收拾他的行李。

source: There will be a flurry of concern, followed by a staff meeting- behind closed doors, so as not to alarm the passengers.
zh_cn: 这会引起一阵纷扰，然后工作人员会关起门来开个会，以便不惊动乘客。

source: Ultimately, there will be a news item: Bob, tragically, must have fallen off the ship on the last night of the voyage while leaning over to get a better camera angle on the northern lights.
zh_cn: 最终，一则新闻会被告知：很不幸，鲍勃一定是在航行的最后那个晚上斜过身去为了争取从更好的角度拍摄北极光而从船上掉了下去。

source: No other explanation is possible.
zh_cn: 此外别无可能。

source: Meanwhile, the passengers will have scattered to the winds, Verna among them.
zh_cn: 与此同时，乘客们会被驱散，其中就有弗娜。
